#pragma once
class BinaryTreeSearch
{
	//конструкторы(по умолчанию, -копирования);
	
	//деструктор;
	
	//поиск узла дерева по ключу;
	
	//получение минимального / максимального ключа дерева(имеет другой алгоритм);
	
	//добавление узла в дерево(имеет другой алгоритм);
	
	//удаление узла из дерева по ключу(возвращает true, если узел был удалён) (имеет другой алгоритм);
	
	
	//-удаление узла из дерева по индексу(возвращает true, если узел был удалён) (имеет другой алгоритм);
	//-получение уровня вершины по ключу(возвращает индекс уровня или - 1, если вершина не найдена) (имеет другой алгоритм);
	//-оператор присваивания
	//-копирование поддерева узла(возвращает новый объект класса);
};

